export const generalConst = {
  errorWithDisplayData: 'Щось пішло не так з відображенням даних. Будь ласка спробуйте знову.',
  updateMsg: 'Зміни успішно збережено!',
  addMsg: 'Запис успішно добавлено!',
  errorMsg: 'Помилка при відпраці даних на сервер. Cпробуйте, будь ласка, пізніше.',
  errorMsgForFaculty: 'Даний факультет вже існує або виникла інша помилка на сервері',
  errorMsgForSpeciality: 'Дана спеціальність вже існує або виникла інша помилка на сервері',
  errorUpdateMsg: 'Запис з такими полями вже існує або виникла інша помилка на сервері',
  errMsgForSubjects: 'Даний предмет вже існує або виникла інша помилка на сервері',
  errMsgForTimeTables: 'Розклад для такої групи і предмету вже можливо існує, або виникла інша помилка на сервері',
  errMsgForGroups: 'Дана група вже існує, або виникла інша помилка на сервері',
  errMsgForAdmins: 'Даний логін або дана електорнна пошта вже існує, або відбулась інша помилка на сервері'
};


