export const generalConst = {
  errorWithDisplayData: 'Щось пішло не так з відображенням даних. Будь ласка спробуйте знову.',
  updateMsg: 'Зміни успішно збережено!',
  addMsg: 'Запис успішно добавлено!',
  errorMsg: 'Помилка при відпраці даних на сервер. Cпробуйте, будь ласка, пізніше.',
  errorUpdateMsg: 'Або дані у всіх полях співпадають або виникла інша помилка на сервері',
  errMsgForSubjects: 'Даний предмет вже існує або виникла інша помилка',
  errMsgForTimeTables: `Розклад для такої групи і предмету вже можливо існує, або виникла інша помилка на сервері`,
  errMsgForGroups: `Дана група вже існує, або виникла інша помилка на сервері`,
  errMsgForAdmins: 'Даний логін або дана електорнна пошта вже існує, або відбулась інша помилка на сервері'
};


